#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//操作符
//算术操作符：+ - * / %
//移位操作符：>> <<
//位操作符：& | ^ //&按位与 //|按位或 //^按位异或
//赋值操作符：= += -= *= %= /= &= |= ^=
//关系操作符：>  >=  <  <=  !=(测试不相等）  ==（测试相等)
//逻辑操作符：&&(逻辑与) ||(逻辑或) (并且或者的关系）
//条件操作符（三目操作符）：exp1?exp2:exp3
//逗号表达式:逗号隔开的一串表达式
// 下标引用，函数调用，结构成员
//单目操作符：只有一个操作数                                                 //a+b// + 有两个操作数，双目操作符
//！逻辑反操作 //- 负值 //+ 正值 //& 取地址 //sizeof() 操作数的类型长度 （以字节为单位）
//~ 对一个数的二进制按位取反 //-- 前置，后置 //++ 前置，后置 //(类型)强制类型转换



//int main()
//{
//	//float a = 9 / 2;//= 4除号两边都是整型，输出的也是整型
//	//float a = 9 / 2.0;
//	int a = 9 % 2;//% 取模，取余
//	
//	printf("%d", a);
//	return 0;
//}

//移位操作符
//int main()
//{
//	int a = 2;//整型是四个字节，一个字节是八个比特位 00000000000000000000000000000010 = 2
//	int b = a << 1;// << 左移操作符 -- 移动的是二进制位// 变成00000000000000000000000000000100 = 4
//	printf("%d", b);
//	return 0;
//}

//赋值操作符
//int main()
//{
//	int a = 2;
//	a = a + 5;//a += 5
//	a = a - 3;//a -= 3
//
//
//	return 0;
//}

//逻辑操作符 && || 
//int main()
//{
	//int a = 3;
	//int b = 5;
	//int c = a && b;//并且。两个同时为真，c才为真，真=1 假=0
	//printf("%d\n", c);//c=1即为真
	//if (a && b)//左边为真，右边为真，ab都为真，大括号内的内容才为真
	//{

	//}
//
//	int a = 3;
//	int b = 0;
//	int c = a || b;//或。其中一个为真就行
//	printf("%d\n", c);
//
//
//	return 0;
//}

//条件操作符（三目操作符）：exp1?exp2:exp3 
//exp1 成立，exp2 计算，整个表达式结果是：exp2的结果
//exp1 不成立，exp3 计算，整个表达式结果是：exp3的结果
//int main()
//{
//	int a = 0;
//	int b = 3;
//	int max = 0;

	//if (a > b)
	//	max = a;
	//else
	//	max = b;

	//max = a > b ? a : b;
	//printf("%d\n", max);
	//return 0;
//}

//逗号表达式
//int main()
//{
//	//{2, 4 + 5, 6};
//	int a = 0;
//	int b = 3;
//	int c = 5;
//	int d = (a = b + 2, c = a - 4, b = c + 2);//从左向右依次计算，输出结果为最后一个表达式结果
//	printf("%d\n", d);
//	return 0;
//}

//下标引用[]
//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };//不是，这是定义数组所用的语法
//	printf("%d\n", arr[5]);//这里的方括号是下标引用操作符
//	return 0;
//}

//函数调用操作符() 可以传多个参数，一个参数不传也行
//int main()
//{
//	//调用函数的时候函数名后面的圆括号()就是函数调用操作符
//	printf("呵呵\n");
//	return 0;
//}









//单目操作符
//!
//int main()
//{
	//c语言表示真假，0表示假的，非零表示真
	//int a = 10;
	//int b = 0;
	//printf("%d\n", !a);//0
	//printf("%d\n", !b);//1
	//if (a)
	//{
	//	//如果a为真，做事
	//}
	//if (!a)
	//{
	//	//如果a为假，做事
	//}
//	return 0;
//}
// a = -5
// a = +5

//sizeof //是操作符不是函数，括号可以省略
//int main()
//{
	//计算变量大小
	//int a = 10;
	//printf("%d\n", sizeof(int)); //int是函数类型，求函数类型的长度时候，括号不能省略
	//printf("%d\n", sizeof a);
	//return 0;
	

	//计算一个数组总大小，单位是字节
//	int arr[10] = { 0 };
//	printf("%d\n", sizeof(arr));//10 * 4 = 40
//	printf("%d\n", sizeof arr[0]);//4
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	printf("%d\n", sz);//40 / 4 = 10
//	return 0;
//}

//~ 按（二进制）位取反：变把所有二进制位中数字，1变成0，0变成1 符号位也变
//int main()
//{
//	//整数在内存中存储的是补码~
//	int a = 0;//0的二进制位:00000000000000000000000000000000//补码
//	printf("%d\n", ~a);//~a:11111111111111111111111111111111//补码//输出10000000000000000000000000000001 = -1
//	//整数的二进制表示有三种：原码，反码，补码
//	//整数在内存中存储的是补码~
//	//正整数的原码，反码，补码相同，负整数的计算如下
//	//-1：10000000000000000000000000000001（原码）//第一位是符号位
//	//-1：11111111111111111111111111111110（反码）//符号位不变，其他所有位相反 1变0 0变1
//	//-1：11111111111111111111111111111111（补码）//反码二进制序列加一 ********整数在内存中存是补码
//	return 0;
//}

// -- ++
//int main()
//{
//	int a = 10;

	//int b = ++a;//前置++ 先++后使用 a变成了11，然后赋给b也是11了
	//printf("%d\n", a);//11
	//printf("%d\n", b);//11
	
//	int b = a++;//后置++ 先使用，再++ a的原值先使用，赋给b,b=10,然后a再++，a=11,先使用a的原值
//	printf("%d\n", a);//11
//	printf("%d\n", b);//10
//	return 0;
//}

//（类型)强制类型转换
//int main()
//{
//	int a = (int)3.14;//double强转int类型，警告⚠消失
//	printf("%d\n", a);
//	return 0;
//}




